express/artillery/search_listings_loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 180
      arrivalRate: 100
scenarios:
  - name: "search listings"
    flow:
      - get:
          url: "/client/listings?query=Singapore"

# figure out how to determine difference in performance using arrivalRate with opt and noopt db

# STORY:
# 1 index 5 shards
# 4 indexes 5 shards
# 4 indexes with 10 shards each