express/artillery/select_listing_loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
  #  'arrivalRate' virtual users/second that last for 'duration' seconds
    - duration: 180
      arrivalRate: 100
scenarios:
  - name: "search listings"
    flow:
      - get:
          url: "/client/listing/FF1WqWABegjmOUHzUrpr?country=Tunisia"